yii/controllers/UsersController.php

    public function actionIndex()
    {
        $query = Users::find();

        $pagination = new Pagination([
            'defaultPageSize' => 20,
            'totalCount' => $query->count(),
        ]);

        $users = $query->orderBy('user_role')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `users`
SELECT * FROM `users` ORDER BY `user_role` LIMIT 10 OFFSET 10